import { h3lp } from './../lib'

const source = [
	'Hola mundo !!!',
	'abcdefghijklmnopqrstuvwxyz0123456789',
	'ABCDEFGHIJKLMNOPQRSTUVWXYZ',
	'?.><":\\\'|";:[{]}=+-_)(*&^%$#@!~` ',
	'Ø ø ᴓ',
	'ɜ ɝ ℨ Ɜ',
	'À Á Â Ã Ä Å à á â ã ä å Ā ā Ă ă Ą ą Ƌ ƌ Ǎ ǎ Ȁ ȁ Ȃ ȃ Ȧ ȧ Ⱥ Ʉ ɑ ɐ ʉ ᴀ Ḁ ḁ  ͣ Ạ ạ Ả ả ⱥ Ɑ Ɐ ',
	'ƀ Ɓ Ƃ ƃ Ƀ ɓ ɞ  ʙ ᴃ Ḃ ḃ Ḅ ḅ Ḇ ḇ ℔ ℬ',
	'ÇçĆ ć Ĉ ĉ Ċ ċ Č č Ɔ Ƈ ƈ ɔ ɕ  ʗ ᴄ ᴐ ᴒ   ͨ  ℂ Ↄ ↄ ',
	'Ď ď Đ đ  Ɖ Ɗ ȡ ɖ ɗ ᴅ  ͩ Ḋ ḋ Ḍ ḍ Ḏ ḏ Ḑ ḑ Ḓ ḓ ⅅ ⅆ ',
	'È É Ê Ëè é ê ë Ē ē Ĕ ĕ Ė ė Ę ę Ě ě  Œ œ Ǝ Ɛ ǝ Ȅ ȅ Ȇ ȇ Ȩ ȩ Ȼ ȼ Ɇ ɇ ɘ ɛ ᴇ ᴈ  ͤ Ḙ ḙ Ḛ ḛ Ẹ ẹ Ẻ ẻ Ẽ ẽ ℭ ℯ ℰ ⅇ ⋿ ',
	'Ƒ ƒ ɍ ɫ ɬ ɟ Ḟ ḟ ẛ ℱ Ⅎ ⅎ ',
	'Ĝ ĝ Ğ ğ Ġ ġ Ģ ģ Ɠ Ǥ ǥ Ǧ ǧ Ǵ ǵ ɠ ɡ ɢ ʚ ʛ Ḡ ḡ ℊ ⅁ Ɡ',
	'Ĥ ĥ Ħ ħ Ȟ ȟ ɦ ʮ ʰ ʜ   ͪ Ḣ ḣ Ḥ ḥ Ḧ ḧ Ḩ ḩ Ḫ ḫ ₕ ℋ ℌ ℍ Ɥ Ɦ',
	'Ĩ ĩ Ī ī Ĭ ĭ Į į İ Ɨ Ǐ ǐ Ȉ ȉ Ȋ ȋ Ì Í Î Ïì í î ï ɨ ɪ ᴉ ᵢ  ͥ Ḭ ḭ Ỉ ỉ Ị ị ⁱ ⅈ ',
	'Ĵ ĵ Ɉ ɉ ȷ ʝ ᴊ ʲ ℐ ℑ ⅉ ',
	'Ƙ ƙ Ǩ ǩ ʞ ᴋ Ḱ ḱ Ḳ ḳ Ḵ ḵ ₖ Ʞ ',
	'Ĺ ĺ Ļ ļ Ľ ľ Ŀ ŀ Ł ł ƚ ȴ ɭ ʟ ᴌ ˡ Ḷ ḷ Ḻ ḻ Ḽ ḽ ₗ ℒ ℓ ⅂ ⅃ Ɫ Ɬ ',
	'ɯ ɰ ɱ  ᴍ ᴟ  ͫ Ḿ ḿ Ṁ ṁ Ṃ ṃ ₘ ℳ Ɱ ',
	'Ñ ñ Ń ń Ņ ņ Ň ň Ɲ ƞ  Ǹ ǹ Ƞ ɲ ɳ ɴ ȵ ᴎ Ṅ ṅ Ṇ ṇ Ṉ ṉ Ṋ ṋ ₙ ℕ ',
	'Ò Ó Ô Õ Ö ò ó ô õ ö Ō ō Ŏ ŏ Ő ő Ɵ Ơ ơ Ǒ ǒ Ȍ ȍ Ȏ ȏ Ȯ ȯ ɵ ᴏ ᴑ  ͦ Ọ ọ Ỏ ỏ ℴ ',
	'Ƥ ƥ ᴘ Ṕ ṕ Ṗ ṗ ₚ ℘ ℙ ',
	'Ǫ ǫ Ɋ ɋ ʠ ℚ ℺ ',
	'Ŕ ŕ Ŗ ŗ Ř ř Ʀ Ȑ ȑ Ȓ ȓ ɹ ɺ ɻ ɼ ɽ ɾ ɿ ʀ ʁ Ɍ ᴙ ᴚ ᵣ ʳ ʴ ʶ   ͬ Ṙ ṙ Ṛ ṛ Ṟ ℛ ℜ ℝ Ɽ ',
	'Ś ś Ŝ ŝ Ş ş Š š Ș ș ȿ ʂ ˢ ṟ Ṡ ṡ Ṣ ṣ ₛ Ȿ ',
	'Ţ ţ Ť ť Ŧ ŧ ƫ Ƭ ƭ Ʈ Ț ț Ⱦ Ƚ ȶ ʇ ʈ ᴛ  ͭ Ṫ ṫ Ṭ ṭ Ṯ ṯ Ṱ ṱ ₜ  ⱦ Ʇ',
	'Ù Ú Û Ü ù ú û ü Ũ ũ Ū ū Ŭ ŭ Ů ů Ű ű Ư ư Ʋ Ǔ ǔ Ȕ ȕ Ȗ ȗ ʋ  ᴜ ᴝ ᴞ ᵤ  ͧ Ṳ ṳ Ṵ ṵ Ṷ ṷ Ụ ụ Ủ ủ ',
	'ʌ ᴠ ᵥ  ͮ Ṽ ṽ Ṿ ṿ ',
	'Ɯ Ŵ ŵ ʍ ᴡ ʷ Ẁ ẁ Ẃ ẃ Ẅ ẅ Ẇ ẇ Ẉ ẉ ',
	'ˣ  ͯ Ẋ ẋ Ẍ ẍ ✕ ✖ ✗ ✘ ',
	'Ý ý ÿ Ų ų Ŷ ŷ Ÿ Ȳ ȳ Ƴ ƴ Ɏ ɏ ɥ ʎ ʏ ʸ Ẏ ẏ Ỳ ỳ Ỵ ỵ Ỷ ỷ Ỹ ỹ ⅄ ',
	'Ź ź Ż ż Ž ž Ƶ ƶ Ȥ ȥ ʐ ʑ ɀ ᴢ Ẑ ẑ Ẓ ẓ Ẕ ẕ ℤ Ɀ'
]

const result:any[] = []
for (const p of source) {
	result.push({ s: p, t: h3lp.string.normalize(p) })
}

console.log(result.map(p => `${p.s} => ${p.t} `).join('\n'))
